## 交换机的工作原理

- 回顾交换机他是属于数据链路层的设备，数据链路层所传输的是数据帧，所封装的是MAC头部（主要有MAC地址，目的MAC地址），差错校验
- 回顾数据链路层的功能
  - 建立逻辑连接，进行物理地址寻址，差错校验
  - 数据链路的建立，维护和拆除
  - 数据帧的封装，传输，同步，差错校验，在数据链路层也可以做流量控制（一般情况下不在数据链路层做）
- 以太网 = 局域网
- 交换机主要讲的以太网交换机（局域网的交换机）
- 早期的网络共享式以太网，目前所使用的式交换式以太网
- 以太网的MAC:用来标识一个以太网上的某个单独的设备或一组设备  IP地址用于标识网络中的某一台主机
  - 两个设备想要在以太网中进行通信，那就必须要MAC地址进行交互
  - 两个设备需要在网络中进行通信，就必须配置相应的IP地址
- MAC地址有48位二进制组成，通常表示为12位的十六进制
- 一个MAC地址表示方式：前24位表示了厂商的编码，后面24位是序列号，从而就可以实现全球唯一
- 单独设备：当第8位为0的时候表示单独设备，单播地址
- 一组设备：当第8位为1的时候表示一组设备，组播地址
- 所有设备: FF-FF-FF-FF-FF-FF，一个全为1的MAC地址，广播地址
- 00-00-00-00-00-00:默认填充的地址，让不知道对方的MAC地址时，会自动填充一个目的的MAC地址
- 以太网的帧
  - Type用于标识上层(网络层)数据的类型：IP(0800), ARP(0806), ICMP, IGMP, RARP

![](../深入浅出计算机网络/images/帧.jpg)

- 以太网交换机
  - 早期的共享式以太网，它是由集线器(HUB)相连，一个冲突域的网络
  - 现在采用交换式网络，广播：一种信息的传播方式；一对多的方式
  - 工作模式：单工，半双工，双工
  - 接口速率：10，100， 1000

- MAC表中维护的是发送方的MAC地址和接口的对应关系；当交换机收到发来的数据帧后查看帧头部，首先查看源MAC地址有没有记录在字节的MAC表中，如果没有，那么记录；主机A--接口1，继续查看目的MAC地址，如果没有，就直接从除接收接口外的所有连接的接口转发（这种方式称为广播），主机B和主机C都收到，主机C丢弃，主机B回应，发现目标的MAC对应在1号接口上，直接从1号接口进行转发出去（单播一对一转发）
  - 首先学习源MAC地址
  - 接着广播数据帧
  - 接收方单播回应，其他主机丢弃
  - 下一次转发直接以单播方式转发数据



## 交换机的基本配置

#### 命令行模式

- 用户模式：查看统计信息（一般情况下用得非常少，用">"表示）；用户模式切换到特权模式 `enable`或者`en`
- 特权模式： 查看并修改设备配置（一般情况下都是查看居多），用"#"表示；特权模式切换到全局模式 `configure termial` 或者 `conf t`
- 全局模式：针对设备的整体配置参数，用"(config)#"表示，全局模式切换到接口模式 `interface fasteternet0/1`或者`int f0/1`
- 接口模式：针对设备的接口修改配置参数，用"(config-if)#"表示
- 进入对应模式，只能一级一级进入
- 返回对应模式，一级一级返回使用`exit`, 如果说想要快速直接返回到特权模式，可以使用`end`
- 当命令输错后，快速终止 ctrl + shift + 6

#### 常见配置

- 永久不进行域名解析

```powershell
Switch(config)#no ip domain-lookup
```

- 给交换机配置一个主机名

```powershell
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname SW1
SW1(config)#
```

- 查看交换机里维护的MAC地址表

```powershell
SW1#show mac-address-table
```

- 交换机的双工模式

```powershell
SW1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#int f0/1
SW1(config-if)#duplex half
SW1(config-if)#end
SW1#show int f0/1    #查看接口
```

- 交换机的接口速率

```powershell
SW1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#int f0/2
SW1(config-if)#speed 10
SW1(config-if)#end
SW1#show int f0/2
```

- 配置console口密码

```powershell
SW1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#line console 0
SW1(config-line)#password 123456
SW1(config-line)#login
```

#### 通过远程管理方式连接交换机(telnet ssh)

- telnet是应用层协议，基于传输层TCP, 默认端口号23， 采用明文密码方式，不是很安全，一般用于内网管理
- ssh是应用层协议，基于传输层TCP,默认端口号22，采用的是密文密码方式，相对来讲比较安全，经常用于跨越互联网管理，也常用于远程管理Linux操作系统
- 既然通过网络的方式进行管理设备，设备就必须配置IP地址，由于交换机上的接口都是交换接口，是不允许配置IP地址，直接为交换机的虚接口配置IP地址，默认情况下交换机的默认虚接口就是vlan 1接口

```powershell
SW1(config)#int vlan 1
SW1(config-if)#ip address 192.168.100.100 255.255.255.0
SW1(config-if)#no shutdown
SW1#show int vlan 1
```

- 配置设备的连接终端并直接设置密码，应用

```powershell
SW1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#line vty 0 4
SW1(config-line)#password 654321
SW1(config-line)#login    #表示直接使用密码登录
# “line vty 0 4”是Cisco设备中的命令，它用于进入Line模式，对vty 0~~4线路进行配置。这里，“0”指vty 0线路，“4”指vty 4线路。这个命令主要是在设备上配置远程登陆的权限，使得用户可以通过Telnet或ssh等方式，无需插Console线缆，只要设备连接网络，配置了接口IP地址即可远程登陆到设备上。
```

- 创建用户名密码，配置连接终端并应用

```powershell
SW1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#username zhangsan password 123456
SW1(config)#line vty 0 4
SW1(config-line)#login local       #表示使用用户名密码登录
```

- 设置特权模式密码（当同时设置了明文和密文密码，密文密码生效）

```powershell
SW1(config)#enable password 123
SW1(config)#enable secret 456
# 456生效
```

- 配置ssh登录

```powershell
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname SW1
SW1(config)#ip domain-name 123.com
SW1(config)#crypto key generate rsa
The name for the keys will be: SW1.123.com
Choose the size of the key modulus in the range of 360 to 2048 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...[OK]

SW1(config)#ip ssh time-out 120
*Mar 1 0:0:59.9: %SSH-5-ENABLED: SSH 1.99 has been enabled
SW1(config)#ip ssh authentication-retries 5
SW1(config)#username lisi password 123
SW1(config)#line vty 0 4
SW1(config-line)#login local
```

## 路由器的工作原理

### 回顾交换机的工作远离

- 交换机里面维护了一张 MAC 地址表，主要记录的是 MAC 地址和接口的对应关系
- 交换机在初始状态下，MAC 地址表是空的，当收到一个来自某接口(f0/1)的数据时，首先查看数据帧中的源 MAC 地址，对照自己的 MAC 地址表，如果不在表中，将发送方的 MAC 地址学习并记录到自己的 MAC 地址表中，并附上对应的接口(f0/1)，再查看目的 MAC 地址，如果目的 MAC 地址也不在 MAC 地址表中，将进行从接收接口(f0/1)外的其他所有连接接口转发出去(广播方式)，此时，目的主机将接收到，其他主机也会接收到，其他主机接收到后直接丢弃，目的主机接收到后进行回应，回应的过程中数据同样会交由交换机进行转发，目的主机这时候就变成发送主机，当交换机接收到来自目的主机的回应报文时(f0/10),同样查看发送方的 MAC 地址，进行学习并记录，并附带对应接口(f0/10),再去查看目的MAC,由于之前已经有记录，所以直接从记录的接口(f0/1)进行转发(单播)
- 总结：交换学习源 MAC,广播数据帧，接收方回应，回应使用单播直接转发

### 回顾路由器相关知识

- 路由器属于三层(网络层)设备
- 网络层所封装的 IP 头部
- 网络层功能
  - 进行逻辑地址(IP 地址)寻址，实现不同网络(网络地址不等或者说内网和外网分割，强调：内网的 IP 地址是无法在外网上进行路由)直接的路径选择
  - 去查找目的是否可以到达，如果可以到达，选择一条最优的路径
- 网络层所传输的 PDU(传输数据单元)是数据包(IP 数据包)

### 网络层 IP 数据包格式

![](../深入浅出计算机网络/images/IP头部.jpg)

#### IPv4 头部

- 版本：标识当前使用的 IP 版本(IPv4, IPv6)
- 首部长度：由于 IP 数据报文的首部有一个可选项，造成首部长度是可变的，所以需要定义
- 区分服务（服务质量/优先级和服务类型）：为了保障更好的服务，主要是在 IP层做QoS
- 总长度：主要用来标识整个数据包的长度
- 标识，标志，片位移：上层的数据到 IP 层会被分片，这几个字段用来对数据包进行标识，使数据到达目的端重组的时候不会乱序
- 生存时间(TTL): 数据包在路由器转发消耗的时间如果小于1 秒，TTL 就会减一
- 协议：标识上层数据是使用的何种协议
- 首部校验：校验数据报文的首部
- 源地址：发送方的 IP 地址
- 目的地址：接收方的 IP 地址

### 路由器的工作原理

- 路由
  - 从源主机到目的主机的转发过程（跨网络访问）
  - 包含两个内容（确定最佳路径，通过网络传输信息）
- 路由表
  - 直连路由：当路由器的接口配置好对应的 IP 地址并开启接口后自动生成
  - 非直连路由：需要手动配置静态路由或者使用动态路由协议学习到
- 静态路由
  - 由管理员手动配置，不灵活，而且是单向
  - 特殊的静态路由：默认路由，当在路由器中找不到目标网络的路由条目时，再去查看默认路由。使用场景：一般应用于末节（末梢）网络（网络的最末端）（路由器的一端只连接了一个网络）
- 动态路由
  - 通过某种动态路由协议自动的去建立自己的路由表
  - 常见的动态路由协议：RIP, OSPF, IS-IS, BGP, IGRP, EIGRP

### 路由器转发数据包的封装过程

