## 交换机的工作原理

- 回顾交换机他是属于数据链路层的设备，数据链路层所传输的是数据帧，所封装的是MAC头部（主要有MAC地址，目的MAC地址），差错校验
- 回顾数据链路层的功能
  - 建立逻辑连接，进行物理地址寻址，差错校验
  - 数据链路的建立，维护和拆除
  - 数据帧的封装，传输，同步，差错校验，在数据链路层也可以做流量控制（一般情况下不在数据链路层做）
- 以太网 = 局域网
- 交换机主要讲的以太网交换机（局域网的交换机）
- 早期的网络共享式以太网，目前所使用的式交换式以太网
- 以太网的MAC:用来标识一个以太网上的某个单独的设备或一组设备  IP地址用于标识网络中的某一台主机
  - 两个设备想要在以太网中进行通信，那就必须要MAC地址进行交互
  - 两个设备需要在网络中进行通信，就必须配置相应的IP地址
- MAC地址有48位二进制组成，通常表示为12位的十六进制
- 一个MAC地址表示方式：前24位表示了厂商的编码，后面24位是序列号，从而就可以实现全球唯一
- 单独设备：当第8位为0的时候表示单独设备，单播地址
- 一组设备：当第8位为1的时候表示一组设备，组播地址
- 所有设备: FF-FF-FF-FF-FF-FF，一个全为1的MAC地址，广播地址
- 00-00-00-00-00-00:默认填充的地址，让不知道对方的MAC地址时，会自动填充一个目的的MAC地址
- 以太网的帧
  - Type用于标识上层(网络层)数据的类型：IP(0800), ARP(0806), ICMP, IGMP, RARP

![](../深入浅出计算机网络/images/帧.jpg)

- 以太网交换机
  - 早期的共享式以太网，它是由集线器(HUB)相连，一个冲突域的网络
  - 现在采用交换式网络，广播：一种信息的传播方式；一对多的方式
  - 工作模式：单工，半双工，双工
  - 接口速率：10，100， 1000

- MAC表中维护的是发送方的MAC地址和接口的对应关系；当交换机收到发来的数据帧后查看帧头部，首先查看源MAC地址有没有记录在字节的MAC表中，如果没有，那么记录；主机A--接口1，继续查看目的MAC地址，如果没有，就直接从除接收接口外的所有连接的接口转发（这种方式称为广播），主机B和主机C都收到，主机C丢弃，主机B回应，发现目标的MAC对应在1号接口上，直接从1号接口进行转发出去（单播一对一转发）
  - 首先学习源MAC地址
  - 接着广播数据帧
  - 接收方单播回应，其他主机丢弃
  - 下一次转发直接以单播方式转发数据



## 交换机的基本配置

#### 命令行模式

- 用户模式：查看统计信息（一般情况下用得非常少，用">"表示）；用户模式切换到特权模式 `enable`或者`en`
- 特权模式： 查看并修改设备配置（一般情况下都是查看居多），用"#"表示；特权模式切换到全局模式 `configure termial` 或者 `conf t`
- 全局模式：针对设备的整体配置参数，用"(config)#"表示，全局模式切换到接口模式 `interface fasteternet0/1`或者`int f0/1`
- 接口模式：针对设备的接口修改配置参数，用"(config-if)#"表示
- 进入对应模式，只能一级一级进入
- 返回对应模式，一级一级返回使用`exit`, 如果说想要快速直接返回到特权模式，可以使用`end`
- 当命令输错后，快速终止 ctrl + shift + 6

#### 常见配置

- 永久不进行域名解析

```powershell
Switch(config)#no ip domain-lookup
```

- 给交换机配置一个主机名

```powershell
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname SW1
SW1(config)#
```

- 查看交换机里维护的MAC地址表

```powershell
SW1#show mac-address-table
```

- 交换机的双工模式

```powershell
SW1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#int f0/1
SW1(config-if)#duplex half
SW1(config-if)#end
SW1#show int f0/1    #查看接口
```

- 交换机的接口速率

```powershell
SW1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#int f0/2
SW1(config-if)#speed 10
SW1(config-if)#end
SW1#show int f0/2
```

- 配置console口密码

```powershell
SW1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#line console 0
SW1(config-line)#password 123456
SW1(config-line)#login
```

#### 通过远程管理方式连接交换机(telnet ssh)

- telnet是应用层协议，基于传输层TCP, 默认端口号23， 采用明文密码方式，不是很安全，一般用于内网管理
- ssh是应用层协议，基于传输层TCP,默认端口号22，采用的是密文密码方式，相对来讲比较安全，经常用于跨越互联网管理，也常用于远程管理Linux操作系统
- 既然通过网络的方式进行管理设备，设备就必须配置IP地址，由于交换机上的接口都是交换接口，是不允许配置IP地址，直接为交换机的虚接口配置IP地址，默认情况下交换机的默认虚接口就是vlan 1接口

```powershell
SW1(config)#int vlan 1
SW1(config-if)#ip address 192.168.100.100 255.255.255.0
SW1(config-if)#no shutdown
SW1#show int vlan 1
```

- 配置设备的连接终端并直接设置密码，应用

```powershell
SW1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#line vty 0 4
SW1(config-line)#password 654321
SW1(config-line)#login    #表示直接使用密码登录
# “line vty 0 4”是Cisco设备中的命令，它用于进入Line模式，对vty 0~~4线路进行配置。这里，“0”指vty 0线路，“4”指vty 4线路。这个命令主要是在设备上配置远程登陆的权限，使得用户可以通过Telnet或ssh等方式，无需插Console线缆，只要设备连接网络，配置了接口IP地址即可远程登陆到设备上。
```

- 创建用户名密码，配置连接终端并应用

```powershell
SW1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#username zhangsan password 123456
SW1(config)#line vty 0 4
SW1(config-line)#login local       #表示使用用户名密码登录
```

- 设置特权模式密码（当同时设置了明文和密文密码，密文密码生效）

```powershell
SW1(config)#enable password 123
SW1(config)#enable secret 456
# 456生效
```

- 配置ssh登录

```powershell
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname SW1
SW1(config)#ip domain-name 123.com
SW1(config)#crypto key generate rsa
The name for the keys will be: SW1.123.com
Choose the size of the key modulus in the range of 360 to 2048 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...[OK]

SW1(config)#ip ssh time-out 120
*Mar 1 0:0:59.9: %SSH-5-ENABLED: SSH 1.99 has been enabled
SW1(config)#ip ssh authentication-retries 5
SW1(config)#username lisi password 123
SW1(config)#line vty 0 4
SW1(config-line)#login local
```

#### 交换机密码恢复

让交换机在启动过程中不加载配置文件，将配置文件修改，从而不会加载

- 拔掉交换机的插头，插上电源同时按住MODE间
- 出现"switch:"提示松开按键，初始化Flash `swtich:flash_init`
- 将config.text文件修改成config.old, 完成后启动交换机

```powershell
Switch:rename flash:config.text flash:config.old
Switch:boot
```

- 重新启动后把配置文件的名字改回来 `Switch:rename flash:config.old flash:config.text`
- 手工加载配置文件 `Switch: copy flash:config.text system:running-config`
- 进入配置模式修改密码
- running-config: 当前配置文件，他是存放在内存中(RAM)由于具有易失性，设备重启后会清空所以当配置完成后需要将当前配置文件的内存保存起来，使用命令write
- startup-config: 保存配置文件，他是存放在非易失性随机访问存储器中(NVRAM),可以永久保存，想要重置设备密码，就需要绕过此文件，在初始化系统的时候将此文件改名，启动后，将文件名改过来，还需要加载到当前配置文件中，将保存配置文件中的内容加载到当前配置文件 copy flash:config.text system:running-config

## 路由器的工作原理

### 回顾交换机的工作远离

- 交换机里面维护了一张 MAC 地址表，主要记录的是 MAC 地址和接口的对应关系
- 交换机在初始状态下，MAC 地址表是空的，当收到一个来自某接口(f0/1)的数据时，首先查看数据帧中的源 MAC 地址，对照自己的 MAC 地址表，如果不在表中，将发送方的 MAC 地址学习并记录到自己的 MAC 地址表中，并附上对应的接口(f0/1)，再查看目的 MAC 地址，如果目的 MAC 地址也不在 MAC 地址表中，将进行从接收接口(f0/1)外的其他所有连接接口转发出去(广播方式)，此时，目的主机将接收到，其他主机也会接收到，其他主机接收到后直接丢弃，目的主机接收到后进行回应，回应的过程中数据同样会交由交换机进行转发，目的主机这时候就变成发送主机，当交换机接收到来自目的主机的回应报文时(f0/10),同样查看发送方的 MAC 地址，进行学习并记录，并附带对应接口(f0/10),再去查看目的MAC,由于之前已经有记录，所以直接从记录的接口(f0/1)进行转发(单播)
- 总结：交换学习源 MAC,广播数据帧，接收方回应，回应使用单播直接转发

### 回顾路由器相关知识

- 路由器属于三层(网络层)设备
- 网络层所封装的 IP 头部
- 网络层功能
  - 进行逻辑地址(IP 地址)寻址，实现不同网络(网络地址不等或者说内网和外网分割，强调：内网的 IP 地址是无法在外网上进行路由)直接的路径选择
  - 去查找目的是否可以到达，如果可以到达，选择一条最优的路径
- 网络层所传输的 PDU(传输数据单元)是数据包(IP 数据包)

### 网络层 IP 数据包格式

![](../深入浅出计算机网络/images/IP头部.jpg)

#### IPv4 头部

- 版本：标识当前使用的 IP 版本(IPv4, IPv6)
- 首部长度：由于 IP 数据报文的首部有一个可选项，造成首部长度是可变的，所以需要定义
- 区分服务（服务质量/优先级和服务类型）：为了保障更好的服务，主要是在 IP层做QoS
- 总长度：主要用来标识整个数据包的长度
- 标识，标志，片位移：上层的数据到 IP 层会被分片，这几个字段用来对数据包进行标识，使数据到达目的端重组的时候不会乱序
- 生存时间(TTL): 数据包在路由器转发消耗的时间如果小于1 秒，TTL 就会减一
- 协议：标识上层数据是使用的何种协议
- 首部校验：校验数据报文的首部
- 源地址：发送方的 IP 地址
- 目的地址：接收方的 IP 地址

### 路由器的工作原理

- 路由
  - 从源主机到目的主机的转发过程（跨网络访问）
  - 包含两个内容（确定最佳路径，通过网络传输信息）
- 路由表
  - 直连路由：当路由器的接口配置好对应的 IP 地址并开启接口后自动生成
  - 非直连路由：需要手动配置静态路由或者使用动态路由协议学习到
- 静态路由
  - 由管理员手动配置，不灵活，而且是单向
  - 特殊的静态路由：默认路由，当在路由器中找不到目标网络的路由条目时，再去查看默认路由。使用场景：一般应用于末节（末梢）网络（网络的最末端）（路由器的一端只连接了一个网络）
- 动态路由
  - 通过某种动态路由协议自动的去建立自己的路由表
  - 常见的动态路由协议：RIP, OSPF, IS-IS, BGP, IGRP, EIGRP

### 路由器转发数据包的封装过程

![](./images/路由器转发数据包过程.jpg)

- PC0访问PC2:第一个报文：源IP: 192.168.10.1 目的IP: 192.168.20.1,源MAC: PC0 mac, 目的MAC: R0 g0/0 MAC
- 当R0收到数据报文后，会解封到网络层，查看目的是否可达，如果可以到转发对应到对应接口，如果不可达重新进行二层封装，源mac变成了R0 g0/0接口mac, 目的mac变成了R1 g0/0
- 当R1收到数据报文后，会解封到网络层，查看目的是否可达，目的和字节是同一网络，肯定可达，讲数据报文交给对应接口，重新进行二层封装，源mac变成R1 g0/1目的mac变成了PC1 fa0
- 路由器在转发数据包的封装过程
  - 源IP和目的IP是没有发生变化
  - 源mac和目的mac一直在发生变化
  - 因为路由器会重新进行二层封装
- 同网段传输主要是二层转发（不需要进行重新封装）
- 跨网段传输是三层转发（需要重新进行二层封装）
- 注意：上述实验路由器需要配置静态路由表



## 静态路由

### 概念

- 静态路由由管理员手工配置，单向，缺乏灵活性
- 默认路由：静态路由的一种，比较特殊，他这里是直接指定目标为任何地方

### 配置

- 静态路由

```powershell
ip route 目标网络(目标的网段/目标网络地址) 目标的子网掩码 下一跳地址(下一个路由器的接口的IP地址或者发往下一个路由器的本地接口)

ip route 192.168.10.0 255.255.255.0 192.168.20.2
ip route 192.168.10.0 255.255.255.0 f0/1
```

- 默认路由

```powershell
ip route 0.0.0.0 0.0.0.0 192.168.20.1
ip route 0.0.0.0 0.0.0.0 f0/1
```

- 查看路由条目 `show ip route`

### 在路由器上配置DHCP

- 目的：使客户机可以通过路由器所提供的DHCP服务获取IP地址
- DHCP: 动态主机配置协议
- 主要是为客户机提供TCP/IP参数：IP地址，子网掩码，网关，DNS服务器地址
- 定义DHCP地址池

```powershell
Router>en
Router#conf t
# 池的名字
Router(config)#ip dhcp pool portlet
# 指定分配的网络范围：网络地址和子网掩码
Router(dhcp-config)#network 192.168.10.0 255.255.255.0
# 指定默认网关
Router(dhcp-config)#default-route 192.168.10.254
# 指定DNS服务器地址
Router(dhcp-config)#dns-server 114.114.114.114
```

- 指定保留地址

```powershell
Router(config)#ip dhcp excluded-address 192.168.10.1 192.168.10.50
```



## 虚拟局域网VLAN

### 目的

- 主要应用在交换机上：一台交换机默认情况下连接一个广播域，因为默认情况下所有的接口都是属于同一个vlan, 默认vlan1, 所以是在同一个广播域中

- 划分广播域，不同广播域是不能够进行通信的，如果想要进行通信，这时候需要借助路由
- 增强网络的安全性
- 简化了网络的管理

### vlan种类

- 静态vlan: 基于端口划分，需要管理员去配置，创建vlan并将接口加入vlan
- 动态vlan: 基于MAC地址自动将同一类型的mac地址加入到同一vlan

### 静态vlan

- vlan范围(思科设备)：总计4096， 0-4095
- 0， 4095保留
- 默认vlan1
- 以太网vlan 2-1001
- 扩展以太网： 1025-4094

### 创建静态vlan

- 在vlan数据库中创建

```powershell
Switch>en
Switch#vlan database
% Warning: It is recommended to configure VLAN from config mode,
  as VLAN database mode is being deprecated. Please consult user
  documentation for configuring VTP/VLAN in config mode.

Switch(vlan)#vlan 2
VLAN 2 added:
    Name: VLAN0002
```

- 在全局模式下创建

```powershell
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 2
Switch(config-vlan)#
```

- 将接口加入vlan:需要去指定接口的模式

```powershell
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int range f0/10-20   #或者 int f0/1
Switch(config-if-range)#sw mode acc  #指定端口模式
Switch(config-if-range)#sw acc vlan 2 #加入对应vlan
```

- 查看vlan信息 `show vlan brief`

```powershell
Switch#show vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/21, Fa0/22, Fa0/23
                                                Fa0/24, Gig0/1, Gig0/2
2    VLAN0002                         active    Fa0/10, Fa0/11, Fa0/12, Fa0/13
                                                Fa0/14, Fa0/15, Fa0/16, Fa0/17
                                                Fa0/18, Fa0/19, Fa0/20
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    
```

- 查看指定vlan `show vlan id 2`

```powershell
Switch#show vlan id 2

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
2    VLAN0002                         active    Fa0/10, Fa0/11, Fa0/12, Fa0/13
                                                Fa0/14, Fa0/15, Fa0/16, Fa0/17
                                                Fa0/18, Fa0/19, Fa0/20

VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
2    enet  100002     1500  -      -      -        -    -        0      0
```

- 删除vlan

```powershell
conf t
no vlan 2
```

- 通过在交换机上创建vlan, 将不同主机加入到对应vlan后，在同一交换机下，相同vlan可以直接进行通信，不同vlan无法直接进行通信

### vlan trunk

- 目的：实现同一vlan跨交换机进行通信
- 交换机接口模式（默认是动态自动）
  - 连接主机：协商的结果是 access
  - 连接交换机：
    - 动态自动 --- 动态自动    协商结果 access
    - 动态自动 --- 动态企望    协商结果 trunk
    - 动态自动 --- access       协商结果 access
    - 动态自动 --- trunk          协商结果 trunk
- trunk 模式协商结果

| SW1 端口模式       | SW2 端口模式      | SW1 结果 | SW2 结果 |
| ------------------ | ----------------- | -------- | -------- |
| trunk              | dynamic auto      | trunk    | trunk    |
| trunk              | dynamic desirable | trunk    | trunk    |
| dynamic auto       | dynamic auto      | access   | access   |
| dynamic auto       | dynamic desirable | trunk    | trunk    |
| dynamic desirable  | dynamic desirable | trunk    | trunk    |
| trunk, nonegotiate | trunk             | trunk    | trunk    |
| trunk, nonegotiate | dynamic auto      | trunk    | access   |
| trunk, nonegotiate | dynamic desirable | trunk    | access   |

- trunk 封装(802.1Q 帧)

![](./images/8021q.jpg)

## 单臂路由

- 在同一交换机上划分vlan, 从而相同vlan主机可以通信，不同vlan不能通信。如果想要不同vlan进行通信，怎么办？
- 不同vlan是属于不同广播域，配置的是不同的网段IP, 针对不同网段IP进行通信，这时候需要借助于路由
- 可以实现不同vlan间的通信技术: 单臂路由，三层交换

![](./images/单臂路由.jpg)

```powershell
# 交换机配置
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 10
Switch(config-vlan)#vlan 20
Switch(config-vlan)#exit
Switch(config)#int f0/1
Switch(config-if)#switchport access vlan 10
Switch(config)#int f1/1
Switch(config-if)#switchport access vlan 20
Switch(config-if)#int f2/1
Switch(config-if)#switchport mode trunk 
Switch(config-if)#exit

#路由器配置
Router>en
Router#conf t
Router(config-if)#int g0/0.1
Router(config-subif)#encapsulation dot1Q 10
Router(config-subif)#ip add 192.168.10.254 255.255.255.0
Router(config-subif)#exit
Router(config)#int g0/0.2
Router(config-subif)#encapsulation dot1Q 20
Router(config-subif)#ip add 192.168.20.254 255.255.255.0
Router(config-subif)#exit
Router(config)#int g0/0
Router(config-if)#no shut
Router(config-if)#exit
Router(config)#ip dhcp pool vlan10
Router(dhcp-config)#network 192.168.10.0 255.255.255.0
Router(dhcp-config)#default-router 192.168.10.254
Router(dhcp-config)#exit
Router(config)#ip dhcp pool vlan20
Router(dhcp-config)#network 192.168.20.0 255.255.255.0
Router(dhcp-config)#default-router 192.168.20.254
Router(dhcp-config)#exit
```

## 三层交换

- 使用单臂路由可以解决不同 vlan间的通信，为什么还有使用三层交换呢
  - 单臂路由容易造成网络瓶颈，子接口依托于物理接口，当 vlan 过多，物理接口压力过大
  - 单臂路由主要是利用路由器的转发，每一次数据来之后都需要进行路由，路由器的工作量比较大

### 基本概念

- 三层交换技术：二层交换技术 + 三层转发技术
- 传统的三层交换：
  - 三层交换机上，第三层引擎处理数据流的第一个包
  - 交换 ASIC 从三层引擎中获取二层重写信息在硬件中创建一个 MLS条目，负责重写和转发数据流中的后续数据包
  - 一次路由多次交换
- 基于 CEF 的三层交换(MLS)
  - 基于路由表直接去生成邻接关系表，直接进行硬件转发
  - 维护了两张表：路由表（转发信息库 FIB）邻接关系表(MAC 地址信息)
  - 工作原理：主机 A 给 B 发送单播数据包；交换机查找 FIB 表，找到下一条地址；查找下一跳地址对应的邻接关系的二层封装信息；转发

![](./images/三层交换.jpg)

![](./images/三层交换实验.jpg)

```powershell
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#ip routing
Switch(config)#vlan 10
Switch(config-vlan)#vlan 20
Switch(config-vlan)#exit
Switch(config)#int range f0/1-14
Switch(config-if-range)#switchport access vlan 10
Switch(config-if-range)#exit
Switch(config)#int range f0/15-24
Switch(config-if-range)#switchport access vlan 20
Switch(config-if-range)#exit
Switch(config)#int vlan 10
Switch(config-if)#ip add 192.168.10.254 255.255.255.0
Switch(config-if)#no shut
Switch(config-if)#exit
Switch(config)#int vlan 20
Switch(config-if)#ip add 192.168.20.254 255.255.255.0
Switch(config-if)#no shut
Switch(config-if)#exit
Switch(config)#ip dhcp pool vlan10
Switch(dhcp-config)#network 192.168.10.0 255.255.255.0
Switch(dhcp-config)#default-router 192.168.10.254
Switch(dhcp-config)#exit
Switch(config)#ip dhcp pool vlan20
Switch(dhcp-config)#network 192.168.20.0 255.255.255.0
Switch(dhcp-config)#default-router 192.168.20.254
Switch(dhcp-config)#exit
```

